sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
/* TIM2 以 1MHz 自由运行，结合溢出中断构成单调的 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 71U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U &&
        counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM2_CH1 只在下一条运动边沿到期时触发，不再占用周期定时器。 */
static bool motion_schedule_compare(uint64_t deadline_ns) {
    uint64_t deadline_us = deadline_ns / 1000ULL;
    if ((deadline_ns % 1000ULL) != 0U && deadline_us != UINT64_MAX) {
        ++deadline_us;
    }
    const uint64_t now_us = board_motion_nanoseconds() / 1000ULL;
    uint64_t delta_us = deadline_us > now_us
                            ? deadline_us - now_us
                            : 0U;
    if (delta_us < CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        delta_us = CONFIG_MOTION_COMPARE_MIN_LEAD_US;
    }
    if (delta_us > INT32_MAX) {
        delta_us = INT32_MAX;
    }

    TIM2->DIER &= ~TIM_DIER_CC1IE;
    uint32_t target = TIM2->CNT + (uint32_t)delta_us;
    TIM2->CCR1 = target;
    TIM2->SR = ~TIM_SR_CC1IF;
    if ((int32_t)(target - TIM2->CNT) <
        (int32_t)CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        target = TIM2->CNT + CONFIG_MOTION_COMPARE_MIN_LEAD_US;
        TIM2->CCR1 = target;
        TIM2->SR = ~TIM_SR_CC1IF;
    }
    TIM2->DIER |= TIM_DIER_CC1IE;
    return true;
}

static void motion_cancel_compare(void) {
    TIM2->DIER &= ~TIM_DIER_CC1IE;
    TIM2->SR = ~TIM_SR_CC1IF;
}

static uint32_t motion_enter_critical(void) {
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    __DMB();
    return state;
}

static void motion_exit_critical(uint32_t state) {
    __DMB();
    if (state == 0U) {
        __enable_irq();
    }
}
#endif

static void can_configure(void) {
    can_handle.Instance = CAN1;
    can_handle.Init.Prescaler = CAN_PRESCALER;
    can_handle.Init.Mode = CAN_MODE_NORMAL;
    can_handle.Init.SyncJumpWidth = CAN_SJW_1TQ;
    can_handle.Init.TimeSeg1 = CAN_BS1_15TQ;
    can_handle.Init.TimeSeg2 = CAN_BS2_2TQ;
    can_handle.Init.TimeTriggeredMode = DISABLE;
    can_handle.Init.AutoBusOff = ENABLE;
    can_handle.Init.AutoWakeUp = DISABLE;
    can_handle.Init.AutoRetransmission = ENABLE;
    can_handle.Init.ReceiveFifoLocked = DISABLE;
    can_handle.Init.TransmitFifoPriority = ENABLE;
    if (HAL_CAN_Init(&can_handle) != HAL_OK) {
        fatal_error();
    }

    CAN_FilterTypeDef filter = {0};
    filter.FilterBank = 0U;
    filter.FilterMode = CAN_FILTERMODE_IDMASK;
    filter.FilterScale = CAN_FILTERSCALE_32BIT;
    filter.FilterFIFOAssignment = CAN_RX_FIFO0;
    filter.FilterActivation = ENABLE;
    if (HAL_CAN_ConfigFilter(&can_handle, &filter) != HAL_OK ||
        HAL_CAN_Start(&can_handle) != HAL_OK) {
        fatal_error();
    }
}

static bool board_can_send(const rbsp_can_frame_t* frame) {
    if (frame == NULL || frame->length > 8U ||
        frame->identifier > 0x7FFU) {
        return false;
    }
    const uint32_t started = HAL_GetTick();
    while (HAL_CAN_GetTxMailboxesFreeLevel(&can_handle) == 0U) {
        if ((uint32_t)(HAL_GetTick() - started) >= 20U) {
            return false;
        }
    }
    CAN_TxHeaderTypeDef header = {0};
    uint32_t mailbox = 0U;
    header.StdId = frame->identifier;
    header.IDE = CAN_ID_STD;
    header.RTR = CAN_RTR_DATA;
    header.DLC = frame->length;
    header.TransmitGlobalTime = DISABLE;
    if (HAL_CAN_AddTxMessage(&can_handle, &header,
                             (uint8_t*)frame->data,
                             &mailbox) != HAL_OK) {
        ++rbsp_diag_can_tx_failures;
        return false;
    }
    ++rbsp_diag_can_tx_frames;
    return true;
}

static void receive_can_frames(void) {
    while (HAL_CAN_GetRxFifoFillLevel(&can_handle, CAN_RX_FIFO0) != 0U) {
        CAN_RxHeaderTypeDef header = {0};
        rbsp_can_frame_t frame = {0};
        if (HAL_CAN_GetRxMessage(&can_handle, CAN_RX_FIFO0, &header,
                                 frame.data) != HAL_OK) {
            ++rbsp_diag_can_rx_failures;
            return;
        }
        if (header.IDE != CAN_ID_STD || header.RTR != CAN_RTR_DATA ||
            header.DLC > 8U) {
            continue;
        }
        ++rbsp_diag_can_rx_frames;
        frame.identifier = header.StdId;
        frame.length = (uint8_t)header.DLC;
        rbsp_core_accept_can(&remote_core, &frame);
    }
}

static void make_node_info(rbsp_node_info_t* info) {
    memset(info, 0, sizeof(*info));
    put_u32(info->uuid + 0U, HAL_GetUIDw0());
    put_u32(info->uuid + 4U, HAL_GetUIDw1());
    put_u32(info->uuid + 8U, HAL_GetUIDw2());
    put_u32(info->uuid + 12U, CONFIG_BOARD_TYPE);
    info->firmware_major = CONFIG_FIRMWARE_VERSION_MAJOR;
    info->firmware_minor = CONFIG_FIRMWARE_VERSION_MINOR;
    info->firmware_patch = CONFIG_FIRMWARE_VERSION_PATCH;
    info->board_type = CONFIG_BOARD_TYPE;
}

int main(void) {
    SCB->VTOR = FLASH_BASE + CONFIG_APPLICATION_FLASH_OFFSET;
    __DSB();
    __ISB();
    HAL_Init();
    system_clock_configure();
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
    if (!motion_slot_configuration_valid()) {
        fatal_error();
    }
#endif
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    board_fixed_io_configure();
#endif
    startup_gpio_configure();
#if defined(CONFIG_REMOTEBSP_PWM) || defined(CONFIG_REMOTEBSP_TIMED_BITSTREAM)
    if (!rbsp_board_waveform_init()) {
        fatal_error();
    }
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_outputs_configure();
    motion_timebase_configure();
#endif
    transceiver_enable();
    can_configure();
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (!rbsp_byte_ring_init(&uart0_rx_ring, uart0_rx_storage,
                             sizeof(uart0_rx_storage)) ||
        !rbsp_byte_ring_init(&uart0_tx_ring, uart0_tx_storage,
                             sizeof(uart0_tx_storage))) {
        fatal_error();
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    const rbsp_soft_half_duplex_uart_hal_t soft_uart_hal = {
        .context = NULL,
        .port_prepare = soft_uart_port_prepare,
        .set_output = soft_uart_set_output,
        .set_input = soft_uart_set_input,
        .read_input = soft_uart_read_input,
        .timing_hz = CONFIG_SYSTEM_CLOCK_HZ,
        .delay_ticks = soft_uart_delay_ticks,
        .irq_save_disable = soft_uart_irq_save_disable,
        .irq_restore = soft_uart_irq_restore,
    };
    if (!rbsp_soft_half_duplex_uart_init(&soft_uart, &soft_uart_hal)) {
        fatal_error();
    }
#endif

    rbsp_node_info_t info;
    make_node_info(&info);
    const rbsp_hal_t hal = {
        .can_send = board_can_send,
        .milliseconds = HAL_GetTick,
        .gpio_configure = board_gpio_configure,
        .gpio_write = board_gpio_write,
        .gpio_read = board_gpio_read,
#if CONFIG_UART_RESOURCE_COUNT > 0
        .uart_configure = board_uart_configure,
        .uart_read = board_uart_read,
        .uart_write = board_uart_write,
#endif
#ifdef CONFIG_REMOTEBSP_PWM
        .pwm_configure = rbsp_board_pwm_configure,
        .pwm_write = rbsp_board_pwm_write,
        .pwm_stop = rbsp_board_pwm_stop,
#endif
#ifdef CONFIG_REMOTEBSP_TIMED_BITSTREAM
        .timed_bitstream_configure = rbsp_board_timed_bitstream_configure,
        .timed_bitstream_write = rbsp_board_timed_bitstream_write,
        .timed_bitstream_busy = rbsp_board_timed_bitstream_busy,
        .timed_bitstream_abort = rbsp_board_timed_bitstream_abort,
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
        .nanoseconds = board_motion_nanoseconds,
        .motion_axis_count = MOTION_SLOT_AXIS_COUNT,
        .motion_set_enable = board_motion_set_enable,
        .motion_set_direction = board_motion_set_direction,
        .motion_set_step = board_motion_set_step,
        .motion_schedule_compare = motion_schedule_compare,
        .motion_cancel_compare = motion_cancel_compare,
        .motion_enter_critical = motion_enter_critical,
        .motion_exit_critical = motion_exit_critical,
#endif
#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
        .enter_bootloader = board_enter_bootloader,
#endif
    };
    if (!rbsp_core_init(&remote_core, &hal, RBSP_CAN_CLASSICAL,
                        &info)) {
        fatal_error();
    }
    for (;;) {
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
        board_breathing_led_poll();
#endif
        receive_can_frames();
        rbsp_core_poll(&remote_core);
    }
}

