sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
void SysTick_Handler(void) {
    HAL_IncTick();
}

#ifdef CONFIG_REMOTEBSP_MOTION
void TIM2_IRQHandler(void) {
    const uint32_t status = TIM2->SR;
    TIM2->SR = ~(status & (TIM_SR_UIF | TIM_SR_CC1IF));
    if ((status & TIM_SR_UIF) != 0U) {
        ++motion_timebase_epochs;
    }
    if ((status & TIM_SR_CC1IF) != 0U) {
        TIM2->DIER &= ~TIM_DIER_CC1IE;
        (void)rbsp_core_motion_service(&remote_core);
    }
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
void USART1_IRQHandler(void) {
    if (!uart0_configured) {
        return;
    }

    const uint32_t status = uart0_handle.Instance->SR;
    const uint32_t receive_flags =
        USART_SR_RXNE | USART_SR_ORE | USART_SR_NE |
        USART_SR_FE | USART_SR_PE;
    if ((status & receive_flags) != 0U) {
        /*
         * F1 通过依次读取 SR 和 DR 清除 RXNE 及接收错误标志。
         * 即使同时出现 ORE，只要 RXNE 有效仍保留当前 DR 字节。
         */
        const uint8_t value = (uint8_t)uart0_handle.Instance->DR;
        if ((status & USART_SR_RXNE) != 0U) {
            if (rbsp_byte_ring_push(&uart0_rx_ring, value)) {
                ++rbsp_diag_uart_rx_bytes;
            } else {
                ++rbsp_diag_uart_rx_overflows;
            }
        }
        if ((status & (USART_SR_ORE | USART_SR_NE |
                       USART_SR_FE | USART_SR_PE)) != 0U) {
            ++rbsp_diag_uart_errors;
        }
    }

    if ((uart0_handle.Instance->SR & USART_SR_TXE) != 0U &&
        (uart0_handle.Instance->CR1 & USART_CR1_TXEIE) != 0U) {
        uint8_t value;
        if (rbsp_byte_ring_pop(&uart0_tx_ring, &value)) {
            uart0_handle.Instance->DR = value;
            ++rbsp_diag_uart_tx_bytes;
        } else {
            __HAL_UART_DISABLE_IT(&uart0_handle, UART_IT_TXE);
        }
    }
}
#endif
